from aiogram.utils.markdown import hbold, hcode, hitalic, hlink

cmd_start = f"""👋🏻 {hbold('Привет')}! Я бот экосистемы чатов МГУ: @chat_msu.

У меня есть множество функций, которые пригодятся в любых чатах. Их список доступен через команду /help.

{hbold('Новости')}: @msu_hub
{hbold('Идеи и предложения')}: @rm_bk ✌🏻
"""

hidden = """
• /itp — image-to-pdf, опознает текст и выдает размеченную пдфку

• /mash — превращает текст в кашу

• /figlet — применить один из шрифтов {hlink('figlet', 'http://www.figlet.org/examples.html/')}
• {hcode('стикер с говняшкой')} — считает ваши какания

• /cicero — повышение красоты текста 
• /quality — повышение качества текста

• /map — карта с осадками по указанной локации

• /2ch board — выдаёт топ тредов с доски (работает только в лс)

• /sa — скопировать существующий анимированный стикер в личный пак
• /sac — аналог /sa, но создает стикерпак для чата, где вызван

• /copy, /see — дублировать сообщение

• /color — раскрасить чб картинку
• /anime — поиск аниме по кадру

• /d6, /dice — бросить кубик
• /stats — статистика бота

• /homer, /sinatra, /vader, /queen, /glados — fake voices
• /remove -- inpaint

Outdated and broken:
• /ag — маски AgileGan ({hlink('link', 'http://www.agilegan.com/')})
• /what — получить описание картинки ({hlink('link', 'https://github.com/karpathy/neuraltalk2/')})
• /faces, /wtf — распознавание объектов
• /bw (/badwiki) — определение сгенерированное GPT-2 ({hlink('link', 'https://badwiki.textgen.cloud/')})
• /avatar — сгенерировать уникальный аватар пользователя
"""

cmd_help = f"""{hbold('Функции бота')}

⚜️ {hbold('Чаты МГУ')}:
• Изначальная цель бота — объединять чаты МГУ обновляемыми закрепами
• @chat_msu — основной чат
• /links — ссылки на все чаты инфраструктуры
• /ping — мониторинг интернета в общежитиях
• /camera — камера с Главного здания
• /minecraft — сервер МГУ

🎙 {hbold('Формат файлов')}:
• /stt — speech-to-text, опознает текст в войсе
• /tts — text-to-speech, переводит текст в речь
• /itt — image-to-text, опознает текст в картинке
• /pdf — конвертирует разные форматы документов в pdf

🗣 {hbold('Языковой перевод')}:
• /tr from to — перевод с языка from на to (ru, en и т.п.)
• /en — перевод на английский
• /ru — перевод на русский
• /langs — доступные языки и их коды

👥 {hbold('Фишки для чатов')}:
• /vote — голосование опросом
• /rate — голосование кнопками
• /like — возможность лайкнуть сообщение
• /raffle — запустить розыгрыш
• /debate — тема для отстаивания

🤖 {hbold('Генерация случайностей')}:
• /roll n m — ролл m чисел из n цифр
• /rolls n m — команда /roll для всех
• /random n m — случайное число от n до m включительно
• /randoms n m — команда /random для всех
• /truth — выдает истину на любой вопрос
• /or — выдает один из вариантов из текста с или

👨🏻‍💻 {hbold('Программирование')}:
• /cpp — выполнить код на C++
• /py — выполнить код на Python 3
• /cpps, /pys — аналоги, но с вводом данных
• /prog — все доступные языки (70 штук)
• /so lang query — результаты со StackOverflow и т.п. ({hlink('cheat.sh', 'https://cheat.sh/')})

🧠 {hbold('Нейронки и прочее')}:
• /wf — результат от WolframAlpha по запросу ({hlink('link', 'https://www.wolframalpha.com/examples/mathematics/')})
• /song — опознаёт песню ({hlink('link', 'https://www.acrcloud.com/')})
• /sr, /wa — увеличить изображение через SRGAN и Waifu2x
• /bg — удаление фона у изображения ({hlink('link', 'https://slazzer.com/')})
• /dd — погрузиться в пучины безумия ({hlink('link', 'https://github.com/google/deepdream/')})
• /da, /std, /ruda, /la, /dae — создать картинку или эмодзи по тексту
• /nsfw — распознавание взрослого контента
• /gpt2, /gpt3, /ogpt, /rugpt — генерация текста
• /toon, /zombie, /an, /arc, /drag, /doll, /dp — разные маски
• /tyan — случайные аниме тянки

📨 {hbold('Стикеры')}:
• /s — добавить изображение в личный стикерпак, через пробел можно задать его эмодзи
• /sc — аналог /s, но создает стикерпак для чата, где вызван
• /sd — удалить стикер из пака
• /a, /m — из текста делает анимированный стикер

📝 {hbold('Обработка текста')}:
• /orfo — проверка текста {hlink('Орфограммкой', 'https://orfogrammka.ru/?campaign=tpsjcbvj&page=home/')}
• s/one/two — аналог sed, ищет паттерн one и заменяет на two
• /t — компилирует LaTeX код
• /trans — транслит текста
• /punto — меняет раскладку: ghbdtn -> привет
• /zalgo — делает страшный текст

🤪 {hbold('Всякие разные')}:
• /w — погода по геометке чата или по запросу
• /wiki — информация по ключевому слову ({hlink('link', 'https://duckduckgo.com/')})
• /ud — определения с Urban Dictionary
• /crypto — курс крипты
• /arxiv — поиск статей на arXiv 
• /l — добавить надпись на картинку
• /de — сделать демотиватор
• /i — загрузить фото на Imgur
• /tenet — разворачивает контент в обратную сторону
• /me — аналог команды эпохи IRC
• /loc — из локации даёт широту и долготу, из широты и долготы даёт локацию
• /excuse — генерирует отмазку
• /gender — узнать гендер
• /geoguess — угадай страну по фото, завершение кнопкой
• /geoguess_top — рейтинг игроков чата
• /json — системная информация о сообщении
• /donate — поддержать развитие бота
• /settings — настройки чата
• /help — вызов этого сообщения

🛠 {hbold('Функции без команд')}:
• Переводит войсы в текст
• Распознает ссылки на посты VK и выдает красиво форматированный результат
• Распознает ссылки на видео YouTube и VK и выдает прямые ссылки
• По локации выдаёт погоду на ближайшее время
• Проверяет новых участников на спамеров по системе CAS
• Поздравляет при успехе бросков: {hcode('🎯')}, {hcode('🏀')}, {hcode('⚽')}, {hcode('🎰')}, {hcode('🎳')}

🟠 {hitalic('Примечание')}: для большинства команд поддержана работа через реплай. Например, команду {hcode('/en')} можно использовать двумя способами:
— набрать текст после команды: {hcode('/en привет')}
— вызвать команду ответом на уже отправленное сообщение

🟢 {hitalic('Примечание')}: для команд с аргументами есть дефолтные значения. Например, {hcode('/rolls')} вызывает {hcode('/rolls 3 1')}.

🔵 {hitalic('Примечание')}: некоторые команды можно вызывать через хештег. Например, {hcode('Получил пятёрку! #like')}. Аргументы у хештегов задаются через подчеркивания, а не пробел. В отличие от команд, хештеги можно писать в любой части текста.

🟣 {hitalic('Примечание')}: максимальный размер файлов доступных ботам в Telegram — 20 Мб.

👨🏻‍💻 {hbold('Создатель')}: {hcode('@rm_bk')}
"""
